Revit 2024 API
BuiltInFailures.StairRampFailures.ContinuousRailNotContinuous Property
 The rail is non-continuous.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ContinuousRailNotContinuous { get; }
Visual Basic
Public Shared ReadOnly Property ContinuousRailNotContinuous As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ContinuousRailNotContinuous {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace